AcDbVertexRef.evaluateAndCacheGeometry
Calls evaluatePoint() and replaces the current constant AcGePoint3d with the
newly evaluated point.

AcDbVertexRef.evaluatePoint(AcGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Evaluates the point from the referenced geometry. If no geometry,
returns the cached point coordinates.

AcDbVertexRef.point
Returns the AcGePoint3d directly held in the AcDbVertexRef.

AcDbVertexRef.impliedType
The following are for implied vertex refs (see more comments comments
at ImpliedType enum). The returned referenced AcDbGeomRef is currently
always an AcDbEdgeRef but we want to keep the protocol general.

AcDbVertexRef.subentId
If referencedRef() is not NULL, returns kNussSubentId, otherwise returns
AcDbSubentId from the base-class AcDbSubentRef.
TODO Jiri kripac:
The semantics of this method is questionable and should be revisited
because an implied vertex does identify a subentity, but there is no
simple AcDbSubentId for it.

AcDbVertexRef.entity
If referencedRef() is not NULL, returns its AcDbCompoundObjectId, otherwise
returns AcDbCompoundObjectId from the base-class AcDbSubentRef.

AcDbVertexRef.#ctor(AcDbVertexRef.ImpliedType,AcDbEdgeRef!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor for creating implied vertex refs, i.e. a vertex being defined
as being a special point on an AcDbEdgeRef. See more comments at the
ImpliedType enum.

AcDbVertexRef.#ctor(AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The constructor makes the AcDbVertexRef keep the AcGePoint3d.

AcDbVertexRef.#ctor(AcDbEntity!System.Runtime.CompilerServices.IsConst*)
The constructor makes the AcDbVertexRef keep the AcDbObjectId of the given
AcDbEntity. Moreover, if the entity is derived from AcDbPoint, it keeps
its AcGePoint3d as AcGePoint3d.

AcDbVertexRef.#ctor(AcDbFullSubentPath!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates AcDbVertexRef from an entity in a block table record
and referenced via a path of block inserts.

AcDbVertexRef.#ctor(AcDbCompoundObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSubentId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The constructor sets the data members of the AcDbEdgeRef.

AcDbVertexRef.#ctor
Default constructor.

AcDbVertexRef
Reference to a vertex, i.e. a subentity whose geometry is a point. It may
either be whole AcDbPoint entity, kVertexSubentType subentity of an entity, or
a constant AcGePoint3d. Notice that this reference is generally non-persistent,
because it uses transient AcDbSubentId.